----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 336, 512]           9,408
       BatchNorm2d-2         [-1, 64, 336, 512]             128
              ReLU-3         [-1, 64, 336, 512]               0
         MaxPool2d-4         [-1, 64, 168, 256]               0
            Conv2d-5        [-1, 128, 168, 256]           8,192
       BatchNorm2d-6        [-1, 128, 168, 256]             256
              ReLU-7        [-1, 128, 168, 256]               0
            Conv2d-8        [-1, 128, 168, 256]           4,608
       BatchNorm2d-9        [-1, 128, 168, 256]             256
             ReLU-10        [-1, 128, 168, 256]               0
           Conv2d-11        [-1, 256, 168, 256]          32,768
      BatchNorm2d-12        [-1, 256, 168, 256]             512
           Conv2d-13        [-1, 256, 168, 256]          16,384
      BatchNorm2d-14        [-1, 256, 168, 256]             512
             ReLU-15        [-1, 256, 168, 256]               0
       Bottleneck-16        [-1, 256, 168, 256]               0
           Conv2d-17        [-1, 128, 168, 256]          32,768
      BatchNorm2d-18        [-1, 128, 168, 256]             256
             ReLU-19        [-1, 128, 168, 256]               0
           Conv2d-20        [-1, 128, 168, 256]           4,608
      BatchNorm2d-21        [-1, 128, 168, 256]             256
             ReLU-22        [-1, 128, 168, 256]               0
           Conv2d-23        [-1, 256, 168, 256]          32,768
      BatchNorm2d-24        [-1, 256, 168, 256]             512
             ReLU-25        [-1, 256, 168, 256]               0
       Bottleneck-26        [-1, 256, 168, 256]               0
           Conv2d-27        [-1, 128, 168, 256]          32,768
      BatchNorm2d-28        [-1, 128, 168, 256]             256
             ReLU-29        [-1, 128, 168, 256]               0
           Conv2d-30        [-1, 128, 168, 256]           4,608
      BatchNorm2d-31        [-1, 128, 168, 256]             256
             ReLU-32        [-1, 128, 168, 256]               0
           Conv2d-33        [-1, 256, 168, 256]          32,768
      BatchNorm2d-34        [-1, 256, 168, 256]             512
             ReLU-35        [-1, 256, 168, 256]               0
       Bottleneck-36        [-1, 256, 168, 256]               0
           Conv2d-37        [-1, 256, 168, 256]          65,536
      BatchNorm2d-38        [-1, 256, 168, 256]             512
             ReLU-39        [-1, 256, 168, 256]               0
           Conv2d-40         [-1, 256, 84, 128]          18,432
      BatchNorm2d-41         [-1, 256, 84, 128]             512
             ReLU-42         [-1, 256, 84, 128]               0
           Conv2d-43         [-1, 512, 84, 128]         131,072
      BatchNorm2d-44         [-1, 512, 84, 128]           1,024
           Conv2d-45         [-1, 512, 84, 128]         131,072
      BatchNorm2d-46         [-1, 512, 84, 128]           1,024
             ReLU-47         [-1, 512, 84, 128]               0
       Bottleneck-48         [-1, 512, 84, 128]               0
           Conv2d-49         [-1, 256, 84, 128]         131,072
      BatchNorm2d-50         [-1, 256, 84, 128]             512
             ReLU-51         [-1, 256, 84, 128]               0
           Conv2d-52         [-1, 256, 84, 128]          18,432
      BatchNorm2d-53         [-1, 256, 84, 128]             512
             ReLU-54         [-1, 256, 84, 128]               0
           Conv2d-55         [-1, 512, 84, 128]         131,072
      BatchNorm2d-56         [-1, 512, 84, 128]           1,024
             ReLU-57         [-1, 512, 84, 128]               0
       Bottleneck-58         [-1, 512, 84, 128]               0
           Conv2d-59         [-1, 256, 84, 128]         131,072
      BatchNorm2d-60         [-1, 256, 84, 128]             512
             ReLU-61         [-1, 256, 84, 128]               0
           Conv2d-62         [-1, 256, 84, 128]          18,432
      BatchNorm2d-63         [-1, 256, 84, 128]             512
             ReLU-64         [-1, 256, 84, 128]               0
           Conv2d-65         [-1, 512, 84, 128]         131,072
      BatchNorm2d-66         [-1, 512, 84, 128]           1,024
             ReLU-67         [-1, 512, 84, 128]               0
       Bottleneck-68         [-1, 512, 84, 128]               0
           Conv2d-69         [-1, 256, 84, 128]         131,072
      BatchNorm2d-70         [-1, 256, 84, 128]             512
             ReLU-71         [-1, 256, 84, 128]               0
           Conv2d-72         [-1, 256, 84, 128]          18,432
      BatchNorm2d-73         [-1, 256, 84, 128]             512
             ReLU-74         [-1, 256, 84, 128]               0
           Conv2d-75         [-1, 512, 84, 128]         131,072
      BatchNorm2d-76         [-1, 512, 84, 128]           1,024
             ReLU-77         [-1, 512, 84, 128]               0
       Bottleneck-78         [-1, 512, 84, 128]               0
           Conv2d-79         [-1, 512, 84, 128]         262,144
      BatchNorm2d-80         [-1, 512, 84, 128]           1,024
             ReLU-81         [-1, 512, 84, 128]               0
           Conv2d-82          [-1, 512, 42, 64]          73,728
      BatchNorm2d-83          [-1, 512, 42, 64]           1,024
             ReLU-84          [-1, 512, 42, 64]               0
           Conv2d-85         [-1, 1024, 42, 64]         524,288
      BatchNorm2d-86         [-1, 1024, 42, 64]           2,048
           Conv2d-87         [-1, 1024, 42, 64]         524,288
      BatchNorm2d-88         [-1, 1024, 42, 64]           2,048
             ReLU-89         [-1, 1024, 42, 64]               0
       Bottleneck-90         [-1, 1024, 42, 64]               0
           Conv2d-91          [-1, 512, 42, 64]         524,288
      BatchNorm2d-92          [-1, 512, 42, 64]           1,024
             ReLU-93          [-1, 512, 42, 64]               0
           Conv2d-94          [-1, 512, 42, 64]          73,728
      BatchNorm2d-95          [-1, 512, 42, 64]           1,024
             ReLU-96          [-1, 512, 42, 64]               0
           Conv2d-97         [-1, 1024, 42, 64]         524,288
      BatchNorm2d-98         [-1, 1024, 42, 64]           2,048
             ReLU-99         [-1, 1024, 42, 64]               0
      Bottleneck-100         [-1, 1024, 42, 64]               0
          Conv2d-101          [-1, 512, 42, 64]         524,288
     BatchNorm2d-102          [-1, 512, 42, 64]           1,024
            ReLU-103          [-1, 512, 42, 64]               0
          Conv2d-104          [-1, 512, 42, 64]          73,728
     BatchNorm2d-105          [-1, 512, 42, 64]           1,024
            ReLU-106          [-1, 512, 42, 64]               0
          Conv2d-107         [-1, 1024, 42, 64]         524,288
     BatchNorm2d-108         [-1, 1024, 42, 64]           2,048
            ReLU-109         [-1, 1024, 42, 64]               0
      Bottleneck-110         [-1, 1024, 42, 64]               0
          Conv2d-111          [-1, 512, 42, 64]         524,288
     BatchNorm2d-112          [-1, 512, 42, 64]           1,024
            ReLU-113          [-1, 512, 42, 64]               0
          Conv2d-114          [-1, 512, 42, 64]          73,728
     BatchNorm2d-115          [-1, 512, 42, 64]           1,024
            ReLU-116          [-1, 512, 42, 64]               0
          Conv2d-117         [-1, 1024, 42, 64]         524,288
     BatchNorm2d-118         [-1, 1024, 42, 64]           2,048
            ReLU-119         [-1, 1024, 42, 64]               0
      Bottleneck-120         [-1, 1024, 42, 64]               0
          Conv2d-121          [-1, 512, 42, 64]         524,288
     BatchNorm2d-122          [-1, 512, 42, 64]           1,024
            ReLU-123          [-1, 512, 42, 64]               0
          Conv2d-124          [-1, 512, 42, 64]          73,728
     BatchNorm2d-125          [-1, 512, 42, 64]           1,024
            ReLU-126          [-1, 512, 42, 64]               0
          Conv2d-127         [-1, 1024, 42, 64]         524,288
     BatchNorm2d-128         [-1, 1024, 42, 64]           2,048
            ReLU-129         [-1, 1024, 42, 64]               0
      Bottleneck-130         [-1, 1024, 42, 64]               0
          Conv2d-131          [-1, 512, 42, 64]         524,288
     BatchNorm2d-132          [-1, 512, 42, 64]           1,024
            ReLU-133          [-1, 512, 42, 64]               0
          Conv2d-134          [-1, 512, 42, 64]          73,728
     BatchNorm2d-135          [-1, 512, 42, 64]           1,024
            ReLU-136          [-1, 512, 42, 64]               0
          Conv2d-137         [-1, 1024, 42, 64]         524,288
     BatchNorm2d-138         [-1, 1024, 42, 64]           2,048
            ReLU-139         [-1, 1024, 42, 64]               0
      Bottleneck-140         [-1, 1024, 42, 64]               0
          Conv2d-141         [-1, 1024, 42, 64]       1,048,576
     BatchNorm2d-142         [-1, 1024, 42, 64]           2,048
            ReLU-143         [-1, 1024, 42, 64]               0
          Conv2d-144         [-1, 1024, 21, 32]         294,912
     BatchNorm2d-145         [-1, 1024, 21, 32]           2,048
            ReLU-146         [-1, 1024, 21, 32]               0
          Conv2d-147         [-1, 2048, 21, 32]       2,097,152
     BatchNorm2d-148         [-1, 2048, 21, 32]           4,096
          Conv2d-149         [-1, 2048, 21, 32]       2,097,152
     BatchNorm2d-150         [-1, 2048, 21, 32]           4,096
            ReLU-151         [-1, 2048, 21, 32]               0
      Bottleneck-152         [-1, 2048, 21, 32]               0
          Conv2d-153         [-1, 1024, 21, 32]       2,097,152
     BatchNorm2d-154         [-1, 1024, 21, 32]           2,048
            ReLU-155         [-1, 1024, 21, 32]               0
          Conv2d-156         [-1, 1024, 21, 32]         294,912
     BatchNorm2d-157         [-1, 1024, 21, 32]           2,048
            ReLU-158         [-1, 1024, 21, 32]               0
          Conv2d-159         [-1, 2048, 21, 32]       2,097,152
     BatchNorm2d-160         [-1, 2048, 21, 32]           4,096
            ReLU-161         [-1, 2048, 21, 32]               0
      Bottleneck-162         [-1, 2048, 21, 32]               0
          Conv2d-163         [-1, 1024, 21, 32]       2,097,152
     BatchNorm2d-164         [-1, 1024, 21, 32]           2,048
            ReLU-165         [-1, 1024, 21, 32]               0
          Conv2d-166         [-1, 1024, 21, 32]         294,912
     BatchNorm2d-167         [-1, 1024, 21, 32]           2,048
            ReLU-168         [-1, 1024, 21, 32]               0
          Conv2d-169         [-1, 2048, 21, 32]       2,097,152
     BatchNorm2d-170         [-1, 2048, 21, 32]           4,096
            ReLU-171         [-1, 2048, 21, 32]               0
      Bottleneck-172         [-1, 2048, 21, 32]               0
   ResNetEncoder-173  [[-1, 3, 672, 1024], [-1, 64, 336, 512], [-1, 256, 168, 256], [-1, 512, 84, 128], [-1, 1024, 42, 64], [-1, 2048, 21, 32]]               0
        Identity-174         [-1, 2048, 21, 32]               0
        Identity-175         [-1, 3072, 42, 64]               0
       Attention-176         [-1, 3072, 42, 64]               0
          Conv2d-177          [-1, 256, 42, 64]       7,077,888
     BatchNorm2d-178          [-1, 256, 42, 64]             512
            ReLU-179          [-1, 256, 42, 64]               0
          Conv2d-180          [-1, 256, 42, 64]         589,824
     BatchNorm2d-181          [-1, 256, 42, 64]             512
            ReLU-182          [-1, 256, 42, 64]               0
        Identity-183          [-1, 256, 42, 64]               0
       Attention-184          [-1, 256, 42, 64]               0
    DecoderBlock-185          [-1, 256, 42, 64]               0
        Identity-186         [-1, 768, 84, 128]               0
       Attention-187         [-1, 768, 84, 128]               0
          Conv2d-188         [-1, 128, 84, 128]         884,736
     BatchNorm2d-189         [-1, 128, 84, 128]             256
            ReLU-190         [-1, 128, 84, 128]               0
          Conv2d-191         [-1, 128, 84, 128]         147,456
     BatchNorm2d-192         [-1, 128, 84, 128]             256
            ReLU-193         [-1, 128, 84, 128]               0
        Identity-194         [-1, 128, 84, 128]               0
       Attention-195         [-1, 128, 84, 128]               0
    DecoderBlock-196         [-1, 128, 84, 128]               0
        Identity-197        [-1, 384, 168, 256]               0
       Attention-198        [-1, 384, 168, 256]               0
          Conv2d-199         [-1, 64, 168, 256]         221,184
     BatchNorm2d-200         [-1, 64, 168, 256]             128
            ReLU-201         [-1, 64, 168, 256]               0
          Conv2d-202         [-1, 64, 168, 256]          36,864
     BatchNorm2d-203         [-1, 64, 168, 256]             128
            ReLU-204         [-1, 64, 168, 256]               0
        Identity-205         [-1, 64, 168, 256]               0
       Attention-206         [-1, 64, 168, 256]               0
    DecoderBlock-207         [-1, 64, 168, 256]               0
        Identity-208        [-1, 128, 336, 512]               0
       Attention-209        [-1, 128, 336, 512]               0
          Conv2d-210         [-1, 32, 336, 512]          36,864
     BatchNorm2d-211         [-1, 32, 336, 512]              64
            ReLU-212         [-1, 32, 336, 512]               0
          Conv2d-213         [-1, 32, 336, 512]           9,216
     BatchNorm2d-214         [-1, 32, 336, 512]              64
            ReLU-215         [-1, 32, 336, 512]               0
        Identity-216         [-1, 32, 336, 512]               0
       Attention-217         [-1, 32, 336, 512]               0
    DecoderBlock-218         [-1, 32, 336, 512]               0
          Conv2d-219        [-1, 16, 672, 1024]           4,608
     BatchNorm2d-220        [-1, 16, 672, 1024]              32
            ReLU-221        [-1, 16, 672, 1024]               0
          Conv2d-222        [-1, 16, 672, 1024]           2,304
     BatchNorm2d-223        [-1, 16, 672, 1024]              32
            ReLU-224        [-1, 16, 672, 1024]               0
        Identity-225        [-1, 16, 672, 1024]               0
       Attention-226        [-1, 16, 672, 1024]               0
    DecoderBlock-227        [-1, 16, 672, 1024]               0
     UnetDecoder-228        [-1, 16, 672, 1024]               0
          Conv2d-229         [-1, 4, 672, 1024]             580
        Identity-230         [-1, 4, 672, 1024]               0
         Softmax-231         [-1, 4, 672, 1024]               0
      Activation-232         [-1, 4, 672, 1024]               0
================================================================
Total params: 31,993,412
Trainable params: 31,993,412
Non-trainable params: 0
----------------------------------------------------------------
Input shap: (3, 672, 1024)
Input size (MB): 7.88
Forward/backward pass size (MB): 7444.50
Params size (MB): 122.05
Estimated Total Size (MB): 7574.42
----------------------------------------------------------------

